<a href="https://colab.research.google.com/github/jimmy-io/worksheeets-/blob/master/01_Getting_%26_Knowing_Your_Data_Occupation_Exercise_with_Solution.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

In [3]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [5]:
## What is the number of observations in the dataset?

users.shape

(943, 4)

In [6]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [7]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [8]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [9]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [12]:
## How many different occupations are in this dataset?

users['occupation'].value_counts().count()

21

In [14]:
## What is the most frequent occupation?

users['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [16]:
## Summarize the DataFrame.

users.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [17]:
##  Summarize only the occupation column

users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [19]:
## What is the mean age of users?

users['age'].mean()

34.05196182396607

In [21]:
## What is the age with least occurrence?

users['age'].value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
11     1
10     1
73     1
66     1
7      1
Name: age, Length: 61, dtype: int64